In [105]:
import pandas as pd
import numpy as np
data = pd.read_csv('C:/Users/ASUS/Documents/Python_Scripts/sampleData.csv', sep = ",")

In [106]:
data
data['tran_date'] = pd.to_datetime(data['tran_date'])

In [108]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
key          6 non-null object
vendor       6 non-null object
tran_date    6 non-null datetime64[ns]
Inv_amt      6 non-null int64
seqno        6 non-null int64
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 320.0+ bytes

In [109]:
data[data.duplicated(['key', 'vendor', 'tran_date'], keep = False) ]

  key vendor  tran_date  Inv_amt  seqno
0   A  alpha 2017-02-21      100      1
1   A  alpha 2017-02-21      100      2
3   B  alpha 2017-02-21      150      4
4   B  alpha 2017-02-21      300      5

In [12]:
#Now what I want to do is calculate percent difference

In [110]:
lagdt = data['tran_date']
lagdt

0   2017-02-21
1   2017-02-21
2   2017-02-14
3   2017-02-21
4   2017-02-21
5   2017-01-31
Name: tran_date, dtype: datetime64[ns]

In [111]:
data['lagdt'] = lagdt.shift(1, axis = 0)
data

  key vendor  tran_date  Inv_amt  seqno      lagdt
0   A  alpha 2017-02-21      100      1        NaT
1   A  alpha 2017-02-21      100      2 2017-02-21
2   A  alpha 2017-02-14       50      3 2017-02-21
3   B  alpha 2017-02-21      150      4 2017-02-14
4   B  alpha 2017-02-21      300      5 2017-02-21
5   C  alpha 2017-01-31       20      6 2017-02-21

In [112]:
data.loc[[not i for i in data.duplicated(['key'])], 'lagdt'] = np.NAN #use explicit location to access the actual cells
data

  key vendor  tran_date  Inv_amt  seqno      lagdt
0   A  alpha 2017-02-21      100      1        NaT
1   A  alpha 2017-02-21      100      2 2017-02-21
2   A  alpha 2017-02-14       50      3 2017-02-21
3   B  alpha 2017-02-21      150      4        NaT
4   B  alpha 2017-02-21      300      5 2017-02-21
5   C  alpha 2017-01-31       20      6        NaT

In [113]:
data['date_diff'] = data['tran_date'] - data['lagdt']
data

  key vendor  tran_date  Inv_amt  seqno      lagdt  date_diff
0   A  alpha 2017-02-21      100      1        NaT        NaT
1   A  alpha 2017-02-21      100      2 2017-02-21     0 days
2   A  alpha 2017-02-14       50      3 2017-02-21    -7 days
3   B  alpha 2017-02-21      150      4        NaT        NaT
4   B  alpha 2017-02-21      300      5 2017-02-21     0 days
5   C  alpha 2017-01-31       20      6        NaT        NaT

In [114]:
data2 = data #no!!! napapalitan yung orig!

In [118]:
data2.columns = '_'+data2.columns

In [125]:
data2.fillna(".")

,_key,_vendor,_tran_date,_Inv_amt,_seqno,_lagdt,_date_diff
0,A,alpha,2017-02-21 00:00:00,100,1,.,.
1,A,alpha,2017-02-21 00:00:00,100,2,2017-02-21 00:00:00,0 days 00:00:00
2,A,alpha,2017-02-14 00:00:00,50,3,2017-02-21 00:00:00,-7 days +00:00:00
3,B,alpha,2017-02-21 00:00:00,150,4,.,.
4,B,alpha,2017-02-21 00:00:00,300,5,2017-02-21 00:00:00,0 days 00:00:00
5,C,alpha,2017-01-31 00:00:00,20,6,.,.

In [127]:
data[(data['_date_diff'] == 0) & (data['_date_diff'] != '.')]

TypeError: invalid type comparison